TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
      case SMTC_MODEM_EVENT_CLASS_B_PING_SLOT_INFO:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: CLASS_B_PING_SLOT_INFO\r\n");
        break;

      case SMTC_MODEM_EVENT_CLASS_B_STATUS:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: CLASS_B_STATUS\r\n");
        break;

      case SMTC_MODEM_EVENT_LORAWAN_MAC_TIME:
        APP_LOG(TS_OFF, VLEVEL_L,  "Event received: LORAWAN MAC TIME\r\n");
        break;

      case SMTC_MODEM_EVENT_LORAWAN_FUOTA_DONE:
      {
        bool status = current_event.event_data.fuota_status.successful;
        if (status == true)
        {
          APP_LOG(TS_OFF, VLEVEL_M,  "Event received: FUOTA SUCCESSFUL\r\n");
        }
        else
        {
          APP_LOG(TS_OFF, VLEVEL_L,  "Event received: FUOTA FAIL\r\n");
        }
        break;
      }

      case SMTC_MODEM_EVENT_NO_MORE_MULTICAST_SESSION_CLASS_C:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: MULTICAST CLASS_C STOP\r\n");
        break;

      case SMTC_MODEM_EVENT_NO_MORE_MULTICAST_SESSION_CLASS_B:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: MULTICAST CLASS_B STOP\r\n");
        break;

      case SMTC_MODEM_EVENT_NEW_MULTICAST_SESSION_CLASS_C:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: New MULTICAST CLASS_C \r\n");
        break;

      case SMTC_MODEM_EVENT_NEW_MULTICAST_SESSION_CLASS_B:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: New MULTICAST CLASS_B\r\n");
        break;

      case SMTC_MODEM_EVENT_FIRMWARE_MANAGEMENT:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: FIRMWARE_MANAGEMENT\r\n");
        if (current_event.event_data.fmp.status == SMTC_MODEM_EVENT_FMP_REBOOT_IMMEDIATELY)
        {
          HAL_NVIC_SystemReset();
        }
        break;

      case SMTC_MODEM_EVENT_STREAM_DONE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: STREAM_DONE\r\n");
        break;

      case SMTC_MODEM_EVENT_UPLOAD_DONE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: UPLOAD_DONE\r\n");
        break;

      case SMTC_MODEM_EVENT_DM_SET_CONF:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: DM_SET_CONF\r\n");
        break;

      case SMTC_MODEM_EVENT_MUTE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: MUTE\r\n");
        break;
      case SMTC_MODEM_EVENT_REGIONAL_DUTY_CYCLE:
      {
        uint8_t duty_cycle_status = current_event.event_data.regional_duty_cycle.status;
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: DUTY_CYCLE busy %d\r\n", duty_cycle_status);
      }
      break;
      default:
        APP_LOG(TS_OFF, VLEVEL_M,  "Unknown event %u\r\n", current_event.event_type);
        break;
    }
  } while (event_pending_count > 0);
}

/* USER CODE BEGIN PB_Callbacks */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case  BUT1_Pin:
      /* Note: when "EventType == TX_ON_TIMER" this GPIO is not initialized */
      if (EventType == TX_ON_EVENT)
      {
        static uint32_t last_press_timestamp_ms = 0;

        /* Debounce the button press, avoid multiple triggers */
        if ((int32_t)(SysTimeToMs(SysTimeGet()) - last_press_timestamp_ms) > 500)
        {
          last_press_timestamp_ms = SysTimeToMs(SysTimeGet());
          user_button_is_press    = true;
        }
      }
      break;
    default:
      break;
  }
}


/* USER CODE END PB_Callbacks */

static void SendTxData(uint8_t port)
{
  /* USER CODE BEGIN SendTxData_1 */
  sensor_t sensor_data;
  uint8_t bufferSize = 0;

  /* Increment tx_counter */
  tx_counter++;
  if (tx_counter > 6U)
  {
    tx_counter = 1U;
  }

  /* Determine which sensors to read this cycle */
  uint8_t sensor_flags = 0U;
  if (tx_counter % 3U == 0U) { sensor_flags |= SENSOR_FLAG_CO2; }
  if (tx_counter % 6U == 0U) { sensor_flags |= SENSOR_FLAG_SPS30; }

  /* Read sensors */
  EnvSensors_Read(&sensor_data, sensor_flags);

  APP_LOG(TS_ON, VLEVEL_M, "Sensors: T=%d.%d degC, RH=%d.%d%%, P=%d hPa, VBAT=%d.%03d V\r\n",
          (int)sensor_data.temperature, (int)(sensor_data.temperature * 10) % 10,
          (int)sensor_data.humidity, (int)(sensor_data.humidity * 10) % 10,
          (int)sensor_data.pressure,
          (int)sensor_data.battery_voltage, (int)(sensor_data.battery_voltage * 1000) % 1000);

  if (sensor_flags & SENSOR_FLAG_CO2)
  {
    APP_LOG(TS_ON, VLEVEL_M, "SCD41: CO2=%u ppm\r\n", (unsigned int)sensor_data.co2_ppm);
  }

  if (sensor_flags & SENSOR_FLAG_SPS30)
  {
    APP_LOG(TS_ON, VLEVEL_M, "SPS30: PM1.0=%d.%d, PM2.5=%d.%d, PM4.0=%d.%d, PM10.0=%d.%d ug/m3\r\n",
            (int)sensor_data.pm1_0, (int)(sensor_data.pm1_0 * 10) % 10,
            (int)sensor_data.pm2_5, (int)(sensor_data.pm2_5 * 10) % 10,
            (int)sensor_data.pm4_0, (int)(sensor_data.pm4_0 * 10) % 10,
            (int)sensor_data.pm10_0, (int)(sensor_data.pm10_0 * 10) % 10);
  }

  enum
  {
    LPP_CH_PRESSURE = 0,
    LPP_CH_TEMPERATURE,
    LPP_CH_HUMIDITY,
    LPP_CH_UV_RAW,
    LPP_CH_BATTERY_V,
    LPP_CH_CO2,
    LPP_CH_PM1_0,
    LPP_CH_PM2_5,
    LPP_CH_PM4_0,
    LPP_CH_PM10_0,
  };

  CayenneLppReset();
  CayenneLppAddBarometricPressure(LPP_CH_PRESSURE, sensor_data.pressure);
  CayenneLppAddTemperature(LPP_CH_TEMPERATURE, sensor_data.temperature);
  CayenneLppAddRelativeHumidity(LPP_CH_HUMIDITY, sensor_data.humidity);
  CayenneLppAddLuminosity(LPP_CH_UV_RAW, (uint16_t)sensor_data.uv_raw);
  CayenneLppAddAnalogInput(LPP_CH_BATTERY_V, sensor_data.battery_voltage);

  if (sensor_flags & SENSOR_FLAG_CO2)
  {
    CayenneLppAddLuminosity(LPP_CH_CO2, sensor_data.co2_ppm);
  }

  if (sensor_flags & SENSOR_FLAG_SPS30)
  {
    uint32_t current_time_s = SysTimeGet().Seconds;
    bool cleaning_triggered = false;

    if (((current_time_s - last_sps30_clean_timestamp) > (SPS30_FAN_CLEAN_INTERVAL_HOURS * 3600U)) &&
        (sensor_data.battery_voltage > 4.12f))
    {
      APP_LOG(TS_OFF, VLEVEL_M, "Manual SPS30 fan cleaning (VBat=%d.%02d V)\r\n", (int)sensor_data.battery_voltage, (int)(sensor_data.battery_voltage * 100) % 100);
      if (SPS30_StartFanCleaning() == SPS30_STATUS_OK)
      {
        last_sps30_clean_timestamp = current_time_s;
        UTIL_TIMER_Start(&Sps30CleanupTimer);
        cleaning_triggered = true;
      } else
      {
        APP_LOG(TS_OFF, VLEVEL_M, "Failed to start SPS30 fan cleaning\r\n");
      }
    }

    if (!cleaning_triggered)
    {
      (void)SPS30_StopMeasurement();
      (void)SPS30_Sleep();
    }
    CayenneLppAddAnalogInput(LPP_CH_PM1_0, sensor_data.pm1_0);
    CayenneLppAddAnalogInput(LPP_CH_PM2_5, sensor_data.pm2_5);
    CayenneLppAddAnalogInput(LPP_CH_PM4_0, sensor_data.pm4_0);
    CayenneLppAddAnalogInput(LPP_CH_PM10_0, sensor_data.pm10_0);
  }

  CayenneLppCopy(AppDataBuffer);
  bufferSize = CayenneLppGetSize();

  if (JoinLedTimer.IsRunning)
  {
    UTIL_TIMER_Stop(&JoinLedTimer);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  }

  ASSERT_SMTC_MODEM_RC(smtc_modem_request_uplink(STACK_ID, port, false, AppDataBuffer, bufferSize));

  if (EventType == TX_ON_TIMER)
  {
    smtc_modem_status_mask_t status_mask = 0;
    smtc_modem_get_status(STACK_ID, &status_mask);
    uint32_t dutycycle = (CertMode || ((status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED)) ? CERT_TX_DUTYCYCLE : APP_TX_DUTYCYCLE;

    ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_start_timer(dutycycle));

    /* Schedule pre-measurement for next TX if it will be a cycle for CO2 or SPS30 */
    uint8_t next_counter = (tx_counter % 6U) + 1U;
    if (next_counter % 3U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Scd41Timer, (dutycycle * 1000U) - SCD41_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Scd41Timer);
    }

    if (next_counter % 6U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Sps30Timer, (dutycycle * 1000U) - SPS30_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Sps30Timer);
    }
  }
  /* USER CODE END SendTxData_1 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static bool IsAllZero(const uint8_t *buffer, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    if (buffer[i] != 0U)
    {
      return false;
    }
  }

  return true;
}

static void OnTxTimerLedEvent(void *context)
{
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
}

static void OnRxTimerLedEvent(void *context)
{
  //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
}

static void OnJoinTimerLedEvent(void *context)
{
  HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
}

static void OnScd41TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SCD41 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_CO2);
}

static void OnSps30TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_SPS30);
}

static void OnSps30CleanupTimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 cleaning finished, going to sleep\r\n");
  (void)SPS30_StopMeasurement();
  (void)SPS30_Sleep();
}

/* USER CODE END PrFD_LedEvents */

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static void OnSleepTimerEvent(void *context)
{
  /* USER CODE BEGIN OnSleepTimerEvent_1 */

  /* USER CODE END OnSleepTimerEvent_1 */
  APP_LOG(TS_ON, VLEVEL_H, "Sleep timer\r\n");

  /* USER CODE BEGIN OnSleepTimerEvent_Last */

  /* USER CODE END OnSleepTimerEvent_Last */
}
#endif /*(LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */

/* --- EOF ------------------------------------------------------------------ */
